[NoCoverage] BooleanLiteral
src/contexts/AuthContext.tsx:28:42
   const [session, setSession] = useState<Session | null>(null);
   const [user, setUser] = useState<User | null>(null);
   const [role, setRole] = useState<UserRole | null>(null);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
 

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:36:99
       console.log("Fetching role for user:", userId);
       
       // Add a timeout so this never hangs
-      const timeoutPromise = new Promise<{ data: null; error: { message: string } }>((resolve) => {
-        setTimeout(() => resolve({ data: null, error: { message: "Role fetch timed out after 5s" } }), 5000);
-      });
+      const timeoutPromise = new Promise<{ data: null; error: { message: string } }>((resolve) => {});
       
       // Fetch ALL roles for the user (they may have both 'patient' and 'admin')

[NoCoverage] ArrowFunction
src/contexts/AuthContext.tsx:37:20
       
       // Add a timeout so this never hangs
       const timeoutPromise = new Promise<{ data: null; error: { message: string } }>((resolve) => {
-        setTimeout(() => resolve({ data: null, error: { message: "Role fetch timed out after 5s" } }), 5000);
+        setTimeout(() => undefined, 5000);
       });
       

[NoCoverage] ObjectLiteral
src/contexts/AuthContext.tsx:37:55
       
       // Add a timeout so this never hangs
       const timeoutPromise = new Promise<{ data: null; error: { message: string } }>((resolve) => {
-        setTimeout(() => resolve({ data: null, error: { message: "Role fetch timed out after 5s" } }), 5000);
+        setTimeout(() => resolve({ data: null, error: {} }), 5000);
       });
       

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:42:15
       
       // Fetch ALL roles for the user (they may have both 'patient' and 'admin')
       const queryPromise = supabase
-        .from("user_roles")
+        .from("")
         .select("role")
         .eq("user_id", userId);

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:44:13
       const queryPromise = supabase
         .from("user_roles")
         .select("role")
-        .eq("user_id", userId);
+        .eq("", userId);
       
       const { data, error } = await Promise.race([queryPromise, timeoutPromise]);

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:48:19
       
       const { data, error } = await Promise.race([queryPromise, timeoutPromise]);
       
-      console.log("Role query result:", { data, error });
+      console.log("", { data, error });
       
       if (error) {

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:50:18
       
       console.log("Role query result:", { data, error });
       
-      if (error) {
-        console.warn("Error fetching role (defaulting to patient):", error);
-        return "patient";
-      }
+      if (error) {}
       
       // If user has an 'admin' role, they're an admin (admin takes priority)

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:51:22
       console.log("Role query result:", { data, error });
       
       if (error) {
-        console.warn("Error fetching role (defaulting to patient):", error);
+        console.warn("", error);
         return "patient";
       }

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:52:16
       
       if (error) {
         console.warn("Error fetching role (defaulting to patient):", error);
-        return "patient";
+        return "";
       }
       

[NoCoverage] ArrowFunction
src/contexts/AuthContext.tsx:56:52
       }
       
       // If user has an 'admin' role, they're an admin (admin takes priority)
-      const roles = Array.isArray(data) ? data.map((r: { role: string }) => r.role) : [];
+      const roles = Array.isArray(data) ? data.map(() => undefined) : [];
       const role: UserRole = roles.includes("admin") ? "admin" : "patient";
       console.log("User role:", role, "(all roles:", roles, ")");

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:57:56
       
       // If user has an 'admin' role, they're an admin (admin takes priority)
       const roles = Array.isArray(data) ? data.map((r: { role: string }) => r.role) : [];
-      const role: UserRole = roles.includes("admin") ? "admin" : "patient";
+      const role: UserRole = roles.includes("admin") ? "" : "patient";
       console.log("User role:", role, "(all roles:", roles, ")");
       return role;

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:58:19
       // If user has an 'admin' role, they're an admin (admin takes priority)
       const roles = Array.isArray(data) ? data.map((r: { role: string }) => r.role) : [];
       const role: UserRole = roles.includes("admin") ? "admin" : "patient";
-      console.log("User role:", role, "(all roles:", roles, ")");
+      console.log("", role, "(all roles:", roles, ")");
       return role;
     } catch (err) {

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:60:19
       const role: UserRole = roles.includes("admin") ? "admin" : "patient";
       console.log("User role:", role, "(all roles:", roles, ")");
       return role;
-    } catch (err) {
-      console.error("Error fetching role:", err);
-      return "patient";
-    }
+    } catch (err) {}
   };
 

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:61:21
       console.log("User role:", role, "(all roles:", roles, ")");
       return role;
     } catch (err) {
-      console.error("Error fetching role:", err);
+      console.error("", err);
       return "patient";
     }

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:62:14
       return role;
     } catch (err) {
       console.error("Error fetching role:", err);
-      return "patient";
+      return "";
     }
   };

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:70:11
     let isMounted = true;
     
     const initializeAuth = async () => {
-      try {
-        const { data: { session }, error: sessionError } = await supabase.auth.getSession();
-        
-        if (sessionError) {
-          console.error("Session error:", sessionError);
-          setError(sessionError.message);
-        }
-        
-        if (isMounted) {
-          setSession(session);
-          setUser(session?.user ?? null);
-          if (session?.user) {
-            const userRole = await fetchRole(session.user.id);
-            setRole(userRole);
-          } else {
-            setRole(null);
-          }
-        }
-      } catch (err) {
+      try {} catch (err) {
         console.error("Auth initialization error:", err);
         setError(err instanceof Error ? err.message : "Auth initialization failed");

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:73:27
       try {
         const { data: { session }, error: sessionError } = await supabase.auth.getSession();
         
-        if (sessionError) {
-          console.error("Session error:", sessionError);
-          setError(sessionError.message);
-        }
+        if (sessionError) {}
         
         if (isMounted) {

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:73:13
       try {
         const { data: { session }, error: sessionError } = await supabase.auth.getSession();
         
-        if (sessionError) {
+        if (true) {
           console.error("Session error:", sessionError);
           setError(sessionError.message);

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:74:25
         const { data: { session }, error: sessionError } = await supabase.auth.getSession();
         
         if (sessionError) {
-          console.error("Session error:", sessionError);
+          console.error("", sessionError);
           setError(sessionError.message);
         }

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:78:24
           setError(sessionError.message);
         }
         
-        if (isMounted) {
-          setSession(session);
-          setUser(session?.user ?? null);
-          if (session?.user) {
-            const userRole = await fetchRole(session.user.id);
-            setRole(userRole);
-          } else {
-            setRole(null);
-          }
-        }
+        if (isMounted) {}
       } catch (err) {
         console.error("Auth initialization error:", err);

[NoCoverage] LogicalOperator
src/contexts/AuthContext.tsx:80:19
         
         if (isMounted) {
           setSession(session);
-          setUser(session?.user ?? null);
+          setUser(session?.user && null);
           if (session?.user) {
             const userRole = await fetchRole(session.user.id);

[NoCoverage] OptionalChaining
src/contexts/AuthContext.tsx:80:19
         
         if (isMounted) {
           setSession(session);
-          setUser(session?.user ?? null);
+          setUser(session.user ?? null);
           if (session?.user) {
             const userRole = await fetchRole(session.user.id);

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:81:15
         if (isMounted) {
           setSession(session);
           setUser(session?.user ?? null);
-          if (session?.user) {
+          if (false) {
             const userRole = await fetchRole(session.user.id);
             setRole(userRole);

[NoCoverage] OptionalChaining
src/contexts/AuthContext.tsx:81:15
         if (isMounted) {
           setSession(session);
           setUser(session?.user ?? null);
-          if (session?.user) {
+          if (session.user) {
             const userRole = await fetchRole(session.user.id);
             setRole(userRole);

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:84:18
           if (session?.user) {
             const userRole = await fetchRole(session.user.id);
             setRole(userRole);
-          } else {
-            setRole(null);
-          }
+          } else {}
         }
       } catch (err) {

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:88:21
             setRole(null);
           }
         }
-      } catch (err) {
-        console.error("Auth initialization error:", err);
-        setError(err instanceof Error ? err.message : "Auth initialization failed");
-      } finally {
+      } catch (err) {} finally {
         if (isMounted) {
           setLoading(false);

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:89:23
           }
         }
       } catch (err) {
-        console.error("Auth initialization error:", err);
+        console.error("", err);
         setError(err instanceof Error ? err.message : "Auth initialization failed");
       } finally {

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:90:55
         }
       } catch (err) {
         console.error("Auth initialization error:", err);
-        setError(err instanceof Error ? err.message : "Auth initialization failed");
+        setError(err instanceof Error ? err.message : "");
       } finally {
         if (isMounted) {

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:91:17
       } catch (err) {
         console.error("Auth initialization error:", err);
         setError(err instanceof Error ? err.message : "Auth initialization failed");
-      } finally {
-        if (isMounted) {
-          setLoading(false);
-        }
-      }
+      } finally {}
     };
 

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:92:13
         console.error("Auth initialization error:", err);
         setError(err instanceof Error ? err.message : "Auth initialization failed");
       } finally {
-        if (isMounted) {
+        if (true) {
           setLoading(false);
         }

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:101:34
     initializeAuth();
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange(
-      async (_event, session) => {
-        if (isMounted) {
-          setSession(session);
-          setUser(session?.user ?? null);
-          if (session?.user) {
-            const userRole = await fetchRole(session.user.id);
-            setRole(userRole);
-          } else {
-            setRole(null);
-          }
-          setLoading(false);
-        }
-      }
+      async (_event, session) => {}
     );
 

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:102:24
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange(
       async (_event, session) => {
-        if (isMounted) {
-          setSession(session);
-          setUser(session?.user ?? null);
-          if (session?.user) {
-            const userRole = await fetchRole(session.user.id);
-            setRole(userRole);
-          } else {
-            setRole(null);
-          }
-          setLoading(false);
-        }
+        if (isMounted) {}
       }
     );

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:102:13
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange(
       async (_event, session) => {
-        if (isMounted) {
+        if (true) {
           setSession(session);
           setUser(session?.user ?? null);

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:105:15
         if (isMounted) {
           setSession(session);
           setUser(session?.user ?? null);
-          if (session?.user) {
+          if (true) {
             const userRole = await fetchRole(session.user.id);
             setRole(userRole);

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:116:18
       }
     );
 
-    return () => {
-      isMounted = false;
-      subscription.unsubscribe();
-    };
+    return () => {};
   }, []);
 

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:130:25
       
       console.log("Full signInWithPassword result:", JSON.stringify(result, null, 2));
       
-      if (result.error) {
-        console.error("Supabase signIn error:", result.error.message);
-        return { error: result.error.message };
-      }
+      if (result.error) {}
       
       // Manually update state after successful login

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:130:11
       
       console.log("Full signInWithPassword result:", JSON.stringify(result, null, 2));
       
-      if (result.error) {
+      if (true) {
         console.error("Supabase signIn error:", result.error.message);
         return { error: result.error.message };

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:131:23
       console.log("Full signInWithPassword result:", JSON.stringify(result, null, 2));
       
       if (result.error) {
-        console.error("Supabase signIn error:", result.error.message);
+        console.error("", result.error.message);
         return { error: result.error.message };
       }

[NoCoverage] ObjectLiteral
src/contexts/AuthContext.tsx:132:16
       
       if (result.error) {
         console.error("Supabase signIn error:", result.error.message);
-        return { error: result.error.message };
+        return {};
       }
       

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:136:11
       }
       
       // Manually update state after successful login
-      if (result.data.session && result.data.user) {
+      if (false) {
         console.log("Sign in successful, updating state:", result.data.user.email);
         setSession(result.data.session);

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:136:11
       }
       
       // Manually update state after successful login
-      if (result.data.session && result.data.user) {
+      if (true) {
         console.log("Sign in successful, updating state:", result.data.user.email);
         setSession(result.data.session);

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:137:21
       
       // Manually update state after successful login
       if (result.data.session && result.data.user) {
-        console.log("Sign in successful, updating state:", result.data.user.email);
+        console.log("", result.data.user.email);
         setSession(result.data.session);
         setUser(result.data.user);

[NoCoverage] BooleanLiteral
src/contexts/AuthContext.tsx:144:20
         // Fetch and set role
         const userRole = await fetchRole(result.data.user.id);
         setRole(userRole);
-        setLoading(false);
+        setLoading(true);
       }
       

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:148:19
       }
       
       return { error: null };
-    } catch (err) {
-      const errorMsg = err instanceof Error ? err.message : "SignIn failed";
-      console.error("SignIn caught exception:", errorMsg);
-      return { error: errorMsg };
-    }
+    } catch (err) {}
   };
 

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:149:61
       
       return { error: null };
     } catch (err) {
-      const errorMsg = err instanceof Error ? err.message : "SignIn failed";
+      const errorMsg = err instanceof Error ? err.message : "";
       console.error("SignIn caught exception:", errorMsg);
       return { error: errorMsg };

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:150:21
       return { error: null };
     } catch (err) {
       const errorMsg = err instanceof Error ? err.message : "SignIn failed";
-      console.error("SignIn caught exception:", errorMsg);
+      console.error("", errorMsg);
       return { error: errorMsg };
     }

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:155:79
     }
   };
 
-  const signUp = async (email: string, password: string, fullName: string) => {
-    const { error } = await supabase.auth.signUp({
-      email,
-      password,
-      options: {
-        data: { full_name: fullName },
-        emailRedirectTo: window.location.origin,
-      },
-    });
-    return { error: error?.message || null };
-  };
+  const signUp = async (email: string, password: string, fullName: string) => {};
 
   const signInAsAdmin = async (email: string, password: string) => {

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:164:21
         emailRedirectTo: window.location.origin,
       },
     });
-    return { error: error?.message || null };
+    return { error: true };
   };
 

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:164:21
         emailRedirectTo: window.location.origin,
       },
     });
-    return { error: error?.message || null };
+    return { error: false };
   };
 

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:171:11
     try {
       // First, try to sign in
       const result = await supabase.auth.signInWithPassword({ email, password });
-      if (result.error) return { error: result.error.message };
+      if (false) return { error: result.error.message };
 
       if (!result.data.session?.user) return { error: "Failed to retrieve session" };

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:171:11
     try {
       // First, try to sign in
       const result = await supabase.auth.signInWithPassword({ email, password });
-      if (result.error) return { error: result.error.message };
+      if (true) return { error: result.error.message };
 
       if (!result.data.session?.user) return { error: "Failed to retrieve session" };

[NoCoverage] BooleanLiteral
src/contexts/AuthContext.tsx:173:11
       const result = await supabase.auth.signInWithPassword({ email, password });
       if (result.error) return { error: result.error.message };
 
-      if (!result.data.session?.user) return { error: "Failed to retrieve session" };
+      if (result.data.session?.user) return { error: "Failed to retrieve session" };
 
       // Use the same fetchRole function that already works

[NoCoverage] OptionalChaining
src/contexts/AuthContext.tsx:173:12
       const result = await supabase.auth.signInWithPassword({ email, password });
       if (result.error) return { error: result.error.message };
 
-      if (!result.data.session?.user) return { error: "Failed to retrieve session" };
+      if (!result.data.session.user) return { error: "Failed to retrieve session" };
 
       // Use the same fetchRole function that already works

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:179:11
       const userRole = await fetchRole(result.data.session.user.id);
       console.log("signInAsAdmin - fetched role:", userRole);
 
-      if (userRole !== "admin") {
+      if (false) {
         // Not an admin, sign them out immediately
         await supabase.auth.signOut();

[NoCoverage] EqualityOperator
src/contexts/AuthContext.tsx:179:11
       const userRole = await fetchRole(result.data.session.user.id);
       console.log("signInAsAdmin - fetched role:", userRole);
 
-      if (userRole !== "admin") {
+      if (userRole === "admin") {
         // Not an admin, sign them out immediately
         await supabase.auth.signOut();

[NoCoverage] OptionalChaining
src/contexts/AuthContext.tsx:186:48
       }
 
       // Manually update state after successful admin login
-      console.log("Admin sign in successful:", result.data.user?.email);
+      console.log("Admin sign in successful:", result.data.user.email);
       setSession(result.data.session);
       setUser(result.data.user);

[NoCoverage] BooleanLiteral
src/contexts/AuthContext.tsx:190:18
       setSession(result.data.session);
       setUser(result.data.user);
       setRole("admin");
-      setLoading(false);
+      setLoading(true);
 
       return { error: null };

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:193:19
       setLoading(false);
 
       return { error: null };
-    } catch (err) {
-      const errorMsg = err instanceof Error ? err.message : "Admin sign in failed";
-      console.error("Admin SignIn exception:", errorMsg);
-      return { error: errorMsg };
-    }
+    } catch (err) {}
   };
 

[NoCoverage] StringLiteral
src/contexts/AuthContext.tsx:194:61
 
       return { error: null };
     } catch (err) {
-      const errorMsg = err instanceof Error ? err.message : "Admin sign in failed";
+      const errorMsg = err instanceof Error ? err.message : "";
       console.error("Admin SignIn exception:", errorMsg);
       return { error: errorMsg };

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:200:31
     }
   };
 
-  const signOut = async () => {
-    await supabase.auth.signOut();
-    setSession(null);
-    setUser(null);
-    setRole(null);
-  };
+  const signOut = async () => {};
 
   return (

[NoCoverage] EqualityOperator
src/contexts/AuthContext.tsx:208:115
   };
 
   return (
-    <AuthContext.Provider value={{ session, user, role, loading, signIn, signUp, signInAsAdmin, signOut, isAdmin: role === "admin" }}>
+    <AuthContext.Provider value={{ session, user, role, loading, signIn, signUp, signInAsAdmin, signOut, isAdmin: role !== "admin" }}>
       {children}
     </AuthContext.Provider>

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:208:115
   };
 
   return (
-    <AuthContext.Provider value={{ session, user, role, loading, signIn, signUp, signInAsAdmin, signOut, isAdmin: role === "admin" }}>
+    <AuthContext.Provider value={{ session, user, role, loading, signIn, signUp, signInAsAdmin, signOut, isAdmin: false }}>
       {children}
     </AuthContext.Provider>

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:215:27
 }
 
 // eslint-disable-next-line react-refresh/only-export-components
-export function useAuth() {
-  const context = useContext(AuthContext);
-  if (!context) throw new Error("useAuth must be used within AuthProvider");
-  return context;
-}
+export function useAuth() {}
 

[NoCoverage] BooleanLiteral
src/contexts/AuthContext.tsx:217:7
 // eslint-disable-next-line react-refresh/only-export-components
 export function useAuth() {
   const context = useContext(AuthContext);
-  if (!context) throw new Error("useAuth must be used within AuthProvider");
+  if (context) throw new Error("useAuth must be used within AuthProvider");
   return context;
 }

[NoCoverage] ConditionalExpression
src/contexts/AuthContext.tsx:217:7
 // eslint-disable-next-line react-refresh/only-export-components
 export function useAuth() {
   const context = useContext(AuthContext);
-  if (!context) throw new Error("useAuth must be used within AuthProvider");
+  if (false) throw new Error("useAuth must be used within AuthProvider");
   return context;
 }
