[NoCoverage] BlockStatement
src/hooks/use-toast.ts:24:18
 
 let count = 0;
 
-function genId() {
-  count = (count + 1) % Number.MAX_SAFE_INTEGER;
-  return count.toString();
-}
+function genId() {}
 
 type ActionType = typeof actionTypes;

[NoCoverage] ArithmeticOperator
src/hooks/use-toast.ts:25:11
 let count = 0;
 
 function genId() {
-  count = (count + 1) % Number.MAX_SAFE_INTEGER;
+  count = (count + 1) * Number.MAX_SAFE_INTEGER;
   return count.toString();
 }

[NoCoverage] ArithmeticOperator
src/hooks/use-toast.ts:25:12
 let count = 0;
 
 function genId() {
-  count = (count + 1) % Number.MAX_SAFE_INTEGER;
+  count = (count - 1) % Number.MAX_SAFE_INTEGER;
   return count.toString();
 }

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:55:47
 
 const toastTimeouts = new Map<string, ReturnType<typeof setTimeout>>();
 
-const addToRemoveQueue = (toastId: string) => {
-  if (toastTimeouts.has(toastId)) {
-    return;
-  }
-
-  const timeout = setTimeout(() => {
-    toastTimeouts.delete(toastId);
-    dispatch({
-      type: "REMOVE_TOAST",
-      toastId: toastId,
-    });
-  }, TOAST_REMOVE_DELAY);
-
-  toastTimeouts.set(toastId, timeout);
-};
+const addToRemoveQueue = (toastId: string) => {};
 
 export const reducer = (state: State, action: Action): State => {

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:56:35
 const toastTimeouts = new Map<string, ReturnType<typeof setTimeout>>();
 
 const addToRemoveQueue = (toastId: string) => {
-  if (toastTimeouts.has(toastId)) {
-    return;
-  }
+  if (toastTimeouts.has(toastId)) {}
 
   const timeout = setTimeout(() => {

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:56:7
 const toastTimeouts = new Map<string, ReturnType<typeof setTimeout>>();
 
 const addToRemoveQueue = (toastId: string) => {
-  if (toastTimeouts.has(toastId)) {
+  if (false) {
     return;
   }

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:60:36
     return;
   }
 
-  const timeout = setTimeout(() => {
-    toastTimeouts.delete(toastId);
-    dispatch({
-      type: "REMOVE_TOAST",
-      toastId: toastId,
-    });
-  }, TOAST_REMOVE_DELAY);
+  const timeout = setTimeout(() => {}, TOAST_REMOVE_DELAY);
 
   toastTimeouts.set(toastId, timeout);

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:73:5
 
 export const reducer = (state: State, action: Action): State => {
   switch (action.type) {
-    case "ADD_TOAST":
-      return {
-        ...state,
-        toasts: [action.toast, ...state.toasts].slice(0, TOAST_LIMIT),
-      };
+    case "ADD_TOAST":
 
     case "UPDATE_TOAST":

[NoCoverage] MethodExpression
src/hooks/use-toast.ts:76:17
     case "ADD_TOAST":
       return {
         ...state,
-        toasts: [action.toast, ...state.toasts].slice(0, TOAST_LIMIT),
+        toasts: [action.toast, ...state.toasts],
       };
 

[NoCoverage] ArrayDeclaration
src/hooks/use-toast.ts:76:17
     case "ADD_TOAST":
       return {
         ...state,
-        toasts: [action.toast, ...state.toasts].slice(0, TOAST_LIMIT),
+        toasts: [].slice(0, TOAST_LIMIT),
       };
 

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:79:5
         toasts: [action.toast, ...state.toasts].slice(0, TOAST_LIMIT),
       };
 
-    case "UPDATE_TOAST":
-      return {
-        ...state,
-        toasts: state.toasts.map((t) => (t.id === action.toast.id ? { ...t, ...action.toast } : t)),
-      };
+    case "UPDATE_TOAST":
 
     case "DISMISS_TOAST": {

[NoCoverage] ObjectLiteral
src/hooks/use-toast.ts:80:14
       };
 
     case "UPDATE_TOAST":
-      return {
-        ...state,
-        toasts: state.toasts.map((t) => (t.id === action.toast.id ? { ...t, ...action.toast } : t)),
-      };
+      return {};
 
     case "DISMISS_TOAST": {

[NoCoverage] ArrowFunction
src/hooks/use-toast.ts:82:34
     case "UPDATE_TOAST":
       return {
         ...state,
-        toasts: state.toasts.map((t) => (t.id === action.toast.id ? { ...t, ...action.toast } : t)),
+        toasts: state.toasts.map(() => undefined),
       };
 

[NoCoverage] EqualityOperator
src/hooks/use-toast.ts:82:42
     case "UPDATE_TOAST":
       return {
         ...state,
-        toasts: state.toasts.map((t) => (t.id === action.toast.id ? { ...t, ...action.toast } : t)),
+        toasts: state.toasts.map((t) => (t.id !== action.toast.id ? { ...t, ...action.toast } : t)),
       };
 

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:85:5
         toasts: state.toasts.map((t) => (t.id === action.toast.id ? { ...t, ...action.toast } : t)),
       };
 
-    case "DISMISS_TOAST": {
-      const { toastId } = action;
-
-      // ! Side effects ! - This could be extracted into a dismissToast() action,
-      // but I'll keep it here for simplicity
-      if (toastId) {
-        addToRemoveQueue(toastId);
-      } else {
-        state.toasts.forEach((toast) => {
-          addToRemoveQueue(toast.id);
-        });
-      }
-
-      return {
-        ...state,
-        toasts: state.toasts.map((t) =>
-          t.id === toastId || toastId === undefined
-            ? {
-                ...t,
-                open: false,
-              }
-            : t,
-        ),
-      };
-    }
+    case "DISMISS_TOAST":
     case "REMOVE_TOAST":
       if (action.toastId === undefined) {

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:85:27
         toasts: state.toasts.map((t) => (t.id === action.toast.id ? { ...t, ...action.toast } : t)),
       };
 
-    case "DISMISS_TOAST": {
-      const { toastId } = action;
-
-      // ! Side effects ! - This could be extracted into a dismissToast() action,
-      // but I'll keep it here for simplicity
-      if (toastId) {
-        addToRemoveQueue(toastId);
-      } else {
-        state.toasts.forEach((toast) => {
-          addToRemoveQueue(toast.id);
-        });
-      }
-
-      return {
-        ...state,
-        toasts: state.toasts.map((t) =>
-          t.id === toastId || toastId === undefined
-            ? {
-                ...t,
-                open: false,
-              }
-            : t,
-        ),
-      };
-    }
+    case "DISMISS_TOAST": {}
     case "REMOVE_TOAST":
       if (action.toastId === undefined) {

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:90:20
 
       // ! Side effects ! - This could be extracted into a dismissToast() action,
       // but I'll keep it here for simplicity
-      if (toastId) {
-        addToRemoveQueue(toastId);
-      } else {
+      if (toastId) {} else {
         state.toasts.forEach((toast) => {
           addToRemoveQueue(toast.id);

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:90:11
 
       // ! Side effects ! - This could be extracted into a dismissToast() action,
       // but I'll keep it here for simplicity
-      if (toastId) {
+      if (false) {
         addToRemoveQueue(toastId);
       } else {

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:92:14
       // but I'll keep it here for simplicity
       if (toastId) {
         addToRemoveQueue(toastId);
-      } else {
-        state.toasts.forEach((toast) => {
-          addToRemoveQueue(toast.id);
-        });
-      }
+      } else {}
 
       return {

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:93:41
       if (toastId) {
         addToRemoveQueue(toastId);
       } else {
-        state.toasts.forEach((toast) => {
-          addToRemoveQueue(toast.id);
-        });
+        state.toasts.forEach((toast) => {});
       }
 

[NoCoverage] ArrowFunction
src/hooks/use-toast.ts:100:34
 
       return {
         ...state,
-        toasts: state.toasts.map((t) =>
-          t.id === toastId || toastId === undefined
-            ? {
-                ...t,
-                open: false,
-              }
-            : t,
+        toasts: state.toasts.map(() => undefined,
         ),
       };

[NoCoverage] EqualityOperator
src/hooks/use-toast.ts:101:11
       return {
         ...state,
         toasts: state.toasts.map((t) =>
-          t.id === toastId || toastId === undefined
+          t.id !== toastId || toastId === undefined
             ? {
                 ...t,

[NoCoverage] EqualityOperator
src/hooks/use-toast.ts:101:31
       return {
         ...state,
         toasts: state.toasts.map((t) =>
-          t.id === toastId || toastId === undefined
+          t.id === toastId || toastId !== undefined
             ? {
                 ...t,

[NoCoverage] ObjectLiteral
src/hooks/use-toast.ts:102:15
         ...state,
         toasts: state.toasts.map((t) =>
           t.id === toastId || toastId === undefined
-            ? {
-                ...t,
-                open: false,
-              }
+            ? {}
             : t,
         ),

[NoCoverage] BooleanLiteral
src/hooks/use-toast.ts:104:23
           t.id === toastId || toastId === undefined
             ? {
                 ...t,
-                open: false,
+                open: true,
               }
             : t,

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:110:5
         ),
       };
     }
-    case "REMOVE_TOAST":
-      if (action.toastId === undefined) {
-        return {
-          ...state,
-          toasts: [],
-        };
-      }
-      return {
-        ...state,
-        toasts: state.toasts.filter((t) => t.id !== action.toastId),
-      };
+    case "REMOVE_TOAST":
   }
 };

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:111:41
       };
     }
     case "REMOVE_TOAST":
-      if (action.toastId === undefined) {
-        return {
-          ...state,
-          toasts: [],
-        };
-      }
+      if (action.toastId === undefined) {}
       return {
         ...state,

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:111:11
       };
     }
     case "REMOVE_TOAST":
-      if (action.toastId === undefined) {
+      if (true) {
         return {
           ...state,

[NoCoverage] ObjectLiteral
src/hooks/use-toast.ts:117:14
           toasts: [],
         };
       }
-      return {
-        ...state,
-        toasts: state.toasts.filter((t) => t.id !== action.toastId),
-      };
+      return {};
   }
 };

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:119:44
       }
       return {
         ...state,
-        toasts: state.toasts.filter((t) => t.id !== action.toastId),
+        toasts: state.toasts.filter((t) => true),
       };
   }

[NoCoverage] MethodExpression
src/hooks/use-toast.ts:119:17
       }
       return {
         ...state,
-        toasts: state.toasts.filter((t) => t.id !== action.toastId),
+        toasts: state.toasts,
       };
   }

[NoCoverage] ArrayDeclaration
src/hooks/use-toast.ts:124:50
   }
 };
 
-const listeners: Array<(state: State) => void> = [];
+const listeners: Array<(state: State) => void> = ["Stryker was here"];
 
 let memoryState: State = { toasts: [] };

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:128:35
 
 let memoryState: State = { toasts: [] };
 
-function dispatch(action: Action) {
-  memoryState = reducer(memoryState, action);
-  listeners.forEach((listener) => {
-    listener(memoryState);
-  });
-}
+function dispatch(action: Action) {}
 
 type Toast = Omit<ToasterToast, "id">;

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:130:35
 
 function dispatch(action: Action) {
   memoryState = reducer(memoryState, action);
-  listeners.forEach((listener) => {
-    listener(memoryState);
-  });
+  listeners.forEach((listener) => {});
 }
 

[NoCoverage] ArrowFunction
src/hooks/use-toast.ts:140:18
 function toast({ ...props }: Toast) {
   const id = genId();
 
-  const update = (props: ToasterToast) =>
-    dispatch({
-      type: "UPDATE_TOAST",
-      toast: { ...props, id },
-    });
+  const update = () => undefined;
   const dismiss = () => dispatch({ type: "DISMISS_TOAST", toastId: id });
 

[NoCoverage] ObjectLiteral
src/hooks/use-toast.ts:143:14
   const update = (props: ToasterToast) =>
     dispatch({
       type: "UPDATE_TOAST",
-      toast: { ...props, id },
+      toast: {},
     });
   const dismiss = () => dispatch({ type: "DISMISS_TOAST", toastId: id });

[NoCoverage] ArrowFunction
src/hooks/use-toast.ts:145:19
       type: "UPDATE_TOAST",
       toast: { ...props, id },
     });
-  const dismiss = () => dispatch({ type: "DISMISS_TOAST", toastId: id });
+  const dismiss = () => undefined;
 
   dispatch({

[NoCoverage] BooleanLiteral
src/hooks/use-toast.ts:152:13
     toast: {
       ...props,
       id,
-      open: true,
+      open: false,
       onOpenChange: (open) => {
         if (!open) dismiss();

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:153:31
       ...props,
       id,
       open: true,
-      onOpenChange: (open) => {
-        if (!open) dismiss();
-      },
+      onOpenChange: (open) => {},
     },
   });

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:154:13
       id,
       open: true,
       onOpenChange: (open) => {
-        if (!open) dismiss();
+        if (true) dismiss();
       },
     },

[NoCoverage] ConditionalExpression
src/hooks/use-toast.ts:154:13
       id,
       open: true,
       onOpenChange: (open) => {
-        if (!open) dismiss();
+        if (false) dismiss();
       },
     },

[NoCoverage] ObjectLiteral
src/hooks/use-toast.ts:159:10
     },
   });
 
-  return {
-    id: id,
-    dismiss,
-    update,
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:166:21
   };
 }
 
-function useToast() {
-  const [state, setState] = React.useState<State>(memoryState);
-
-  React.useEffect(() => {
-    listeners.push(setState);
-    return () => {
-      const index = listeners.indexOf(setState);
-      if (index > -1) {
-        listeners.splice(index, 1);
-      }
-    };
-  }, [state]);
-
-  return {
-    ...state,
-    toast,
-    dismiss: (toastId?: string) => dispatch({ type: "DISMISS_TOAST", toastId }),
-  };
-}
+function useToast() {}
 
 export { useToast, toast };

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:169:25
 function useToast() {
   const [state, setState] = React.useState<State>(memoryState);
 
-  React.useEffect(() => {
-    listeners.push(setState);
-    return () => {
-      const index = listeners.indexOf(setState);
-      if (index > -1) {
-        listeners.splice(index, 1);
-      }
-    };
-  }, [state]);
+  React.useEffect(() => {}, [state]);
 
   return {

[NoCoverage] BlockStatement
src/hooks/use-toast.ts:171:18
 
   React.useEffect(() => {
     listeners.push(setState);
-    return () => {
-      const index = listeners.indexOf(setState);
-      if (index > -1) {
-        listeners.splice(index, 1);
-      }
-    };
+    return () => {};
   }, [state]);
 

[NoCoverage] UnaryOperator
src/hooks/use-toast.ts:173:19
     listeners.push(setState);
     return () => {
       const index = listeners.indexOf(setState);
-      if (index > -1) {
+      if (index > +1) {
         listeners.splice(index, 1);
       }

[NoCoverage] EqualityOperator
src/hooks/use-toast.ts:173:11
     listeners.push(setState);
     return () => {
       const index = listeners.indexOf(setState);
-      if (index > -1) {
+      if (index >= -1) {
         listeners.splice(index, 1);
       }

[NoCoverage] ArrowFunction
src/hooks/use-toast.ts:182:14
   return {
     ...state,
     toast,
-    dismiss: (toastId?: string) => dispatch({ type: "DISMISS_TOAST", toastId }),
+    dismiss: () => undefined,
   };
 }

[NoCoverage] StringLiteral
src/hooks/use-toast.ts:182:53
   return {
     ...state,
     toast,
-    dismiss: (toastId?: string) => dispatch({ type: "DISMISS_TOAST", toastId }),
+    dismiss: (toastId?: string) => dispatch({ type: "", toastId }),
   };
 }
